dangernoodle-io/breadboard/examples/floor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_CHECK_STACKOVERFLOW=2
CONFIG_LOG_DEFAULT_LEVEL=3

# FOUNDATIONAL FLOOR (jae/autowire-sweep): all bb_log sinks off -- this is the
# true floor, console logging only. bb_log's CMakeLists REQUIRES are now
# Kconfig-conditional to match these gates (see components/bb_log/CMakeLists.txt),
# so leaving these =n also shrinks the component-discovery closure itself,
# not just the compiled sources.
CONFIG_BB_LOG_ROUTES=n
CONFIG_BB_LOG_UDP_SINK=n

# Free size win: smallest floor, not fastest.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_NEWLIB_NANO_FORMAT=y

# INTERIM scaffold (B1-1077): bb_diag dispatcher needs ~7.5KB stack
# (storage/nvs worst-case); right-size or move buffers to heap once the
# full /api/diag surface is migrated + measured.
CONFIG_BB_HTTP_TASK_STACK_SIZE=16384

# PR6 (floor HW-validation gate): opt in to the destructive
# POST /api/diag/factory-reset route (default n) so floor's bench board
# can validate the full diag/storage HTTP surface end to end.
CONFIG_BB_STORAGE_HTTP_FACTORY_RESET=y
